{
  "_meta": {
    "maxChars": {
      "start_button": 6,
      "continue_button": 8,
      "tap_to_dismiss": 20,
      "evolution_title": 10,
      "choose_trait_to_evolve": 27,
      "evolving_title": 9,
      "you_have_evolved_the_trait": 27,
      "effects": 9,
      "you_win": 8,
      "you_lose": 9,
      "learn-o-meter": 14,
      "train_button": 5,
      "survival_1_1_1": 415,
      "survival_1_1_2": 203,
      "survival_1_1_3": 254,
      "survival_1_1_4": 283,
      "survival_1_1_5": 391,
      "survival_1_1_6": 117,
      "survival_1_1_7": 193,
      "survival_1_1_8": 86,
      "survival_1_1_9": 133,
      "survival_1_2_1": 244,
      "survival_1_3_1": 317,
      "survival_1_4_1": 370,
      "survival_1_5_1": 254,
      "survival_1_5_2": 250,
      "survival_1_6_1": 59,
      "survival_1_7_1": 179,
      "survival_1_7_2": 230,
      "survival_1_7_3": 287,
      "survival_1_7_4": 145,
      "survival_1_8_1": 132,
      "survival_1_8_2": 169,
      "survival_1_8_3": 181,
      "survival_1_8_4": 141,
      "survival_1_8_5": 132,
      "survival_1_8_6": 71,
      "survival_1_9_1": 85,
      "survival_1_10_1": 58,
      "mating_1_1_1": 100,
      "mating_1_1_2": 184,
      "mating_1_1_3": 159,
      "mating_1_1_4": 156,
      "mating_1_1_5": 105,
      "mating_1_1_6": 177,
      "mating_1_1_7": 47,
      "mating_1_1_8": 163,
      "mating_1_2_1": 150,
      "mating_1_2_2": 154,
      "mating_1_2_3": 118,
      "mating_1_2_4": 140,
      "mating_1_2_5": 151,
      "mating_1_2_6": 147,
      "mating_1_2_7": 118,
      "mating_1_3_1": 143,
      "mating_1_3_2": 167,
      "mating_1_3_3": 75,
      "mating_1_3_4": 154,
      "mating_1_3_5": 170,
      "mating_1_3_6": 150,
      "training_1_1_1": 342,
      "training_1_1_2": 134,
      "training_1_1_3": 75,
      "training_1_2_1": 248,
      "training_1_2_2": 181,
      "training_1_2_3": 188,
      "training_1_2_4": 82,
      "training_1_3_1": 218,
      "training_1_3_2": 91,
      "training_1_3_3": 154,
      "training_1_3_4": 176,
      "training_1_3_5": 192,
      "trait_eyes_name": 33,
      "trait_eyes_desc": 149,
      "trait_eyes_effect": 46,
      "trait_feet_name": 31,
      "trait_feet_desc": 377,
      "trait_feet_effect": 63,
      "trait_furs_name": 23,
      "trait_furs_desc": 149,
      "trait_furs_effect": 46,
      "trait_humps_name": 11,
      "trait_humps_desc": 267,
      "trait_humps_effect": 19,
      "trait_metabolism_name": 27,
      "trait_metabolism_desc": 223,
      "trait_metabolism_effect": 21,
      "trait_mouth_name": 22,
      "trait_mouth_desc": 239,
      "trait_mouth_effect": 38,
      "trait_run_name": 14,
      "trait_run_desc": 136,
      "trait_run_effect": 38,
      "trait_jump_name": 15,
      "trait_jump_desc": 190,
      "trait_jump_effect": 39
    }
  },
  "en": {
    "start_button": "Start!",
    "continue_button": "Continue",
    "tap_to_dismiss": "Tap To Dismiss . . .",
    "evolution_title": "Evolution!",
    "choose_trait_to_evolve": "Choose the trait to evolve:",
    "evolving_title": "Evolving!",
    "you_have_evolved_the_trait": "You have evolved the trait:",
    "effects": "Effects:",
    "you_win": "You win!",
    "you_lose": "You lose!",
    "learn-o-meter": "Learn-O-meter:",
    "train_button": "Train",
    "survival_1_1_1": "Hello students. Welcome to 'Circus Camel: Inherited, Environmental, and Learned'\r\n\r\nIn this game, you will learn all about the traits of an organism. Whether it is evolved because of the environment, inherited from the organism's parents, or learned from experience and training.\r\n\r\nHopefully, you can learn while having some fun with this game. Please tap any key or anywhere on the screen to continue...",
    "survival_1_1_2": "We will now begin with the first stage. In this stage, you will learn about environmental traits. An environmental trait is characteristic or feature of an organism that is influenced by its environment.",
    "survival_1_1_3": "Meet Fonz, the ancient camel. He is a new kid on the desert. He has just come from the plains and hasn't adapted yet for living in the desert. Let us help him to survive in the desert, shall we?\r\n\r\nBut first, let us learn about how to play this game.",
    "survival_1_1_4": "This is the health indicator. It shows the health and stamina of the camel. When the red circle around the health icon is gone, it means the health is zero. If the health becomes zero, that means Fonz has passed away. And you will lose the game. Please take caution about the health.",
    "survival_1_1_5": "This is the food indicator. It shows how much food has Fonz stored in his body. When the circle around the food icon is gone, then it means the camel is starving. When Fonz is starving, he will lose health by a lot every second, until you can find food to fill his stomach again.\r\n\r\nAs you can see, Fonz's stomach is still half full. What you need to do now is to get some food for Fonz.",
    "survival_1_1_6": "This is a bush. It contains all the nutrients and food to keep organisms, such as a camel like Fonz, living and well.",
    "survival_1_1_7": "And this is a cactus. Just like the bush, it also contains all the nutrients and food to keep organisms alive and well.\r\n\r\nHowever, you should be wary about its thorns. They might hurt you.",
    "survival_1_1_8": "Tap to dismiss the dialog, and then move the camel to the bush and cactus to eat them.",
    "survival_1_1_9": "Tap and drag anywhere on the screen to move the camel. Or press the W/S/A/D keys on your keyboard. You can also press the arrow keys.",
    "survival_1_2_1": "You have eaten some food. Notice that the food indicator went up a little bit. Fonz now is feeling more energized thanks to you.\r\n\r\nBeware! If the food indicator is empty, Fonz will receive damage to his health for every second that passes.",
    "survival_1_3_1": "The cactus holds a lot of water and nutrients. It is very refreshing for the camel. However, its thorns are sharp and pointy. They have hurt the insides of the camel. So Fonz's health is reduced by quite a lot.\r\n\r\nYou need to evolve him and get a trait that will help him to chew a cactus without hurting himself.",
    "survival_1_4_1": "Ouch, that hurts! Have you noticed that the health is reducing every second even though Fonz still has food in his stomach? This is because the ancient camel's body is still not adapted to living in the harsh desert. The camel can't protect himself from heatstroke and the environmental hazards. He needs to evolve some traits that will protect him from the environment.",
    "survival_1_5_1": "To survive the desert, Fonz must evolve and develop the necessary traits. Right now, we need the traits that can protect him from environmental hazards, especially heat. And we also need traits that can permit Fonz to eat cactus without injuring himself.",
    "survival_1_5_2": "To evolve, you need DNA. DNA is a molecule that contains the genetic code that is unique for every organism. It is the factor to determine the traits and characteristics of every organism.\r\n\r\nCollect DNA throughout the field and evolve the camel.",
    "survival_1_6_1": "Good, now choose one of the traits to evolve from the list.",
    "survival_1_7_1": "Well done. You have evolved a trait. This type of traits is called the 'Environmental Trait'. It is a kind of trait that is influenced by the environment where the organism lives.",
    "survival_1_7_2": "Now, Fonz can endure the hardships from the environment better. Please continue collecting DNA to evolve the camel further with other traits. The traits will increase the survival of the camel against the harsh desert environment.",
    "survival_1_7_3": "Collect DNAs until we get the necessary amount to evolve. The highlighted part of the screen is the DNA indicator. The number on the right is to indicate how many DNAs you need to collect before we can evolve. While the number on the left is how many DNAs that you have collected so far.",
    "survival_1_7_4": "You have finished the tutorial about how to play this game. Now, collect all the things to survive on the desert! Survive for as long as you can!",
    "survival_1_8_1": "Congratulations! You have finished the stage. Before we conclude this stage, let us do some recap about what we have learned so far.",
    "survival_1_8_2": "Living creatures can be exposed to the hazards of the environment they are living in. And because of that, they need to adapt by evolving some traits for their survival.",
    "survival_1_8_3": "Camel, for example, didn't have the traits that could make them survive the harsh desert environment in ancient time. That's why they need to evolve some traits so they can survive.",
    "survival_1_8_4": "These traits are called the environmental traits. Environmental traits are traits that are influenced by the environment around the organism.",
    "survival_1_8_5": "In this stage, the camel has evolved 3 traits: thick fur and underwool; thick mouth and tongue; and longer legs and wide/thick feet.",
    "survival_1_8_6": "The camel's evolution is not over yet. So let's move to the next stage.",
    "survival_1_9_1": "You lose. Fonz doesn't have any health left to keep on living. Try again next time...",
    "survival_1_10_1": "Well done! Move the camel to the trophy to end this stage!",
    "mating_1_1_1": "Hi there! Welcome to the second stage. In this stage, we will learn about inherited trait. Let's go!",
    "mating_1_1_2": "Do you remember Fonz? The camel that we played as in the first stage? Now he has found his true love. A female camel named Sahara. They fall in love at first sight and decided to mate.",
    "mating_1_1_3": "But they have different characteristics from one another. Fonz and Sahara chose different traits as their evolution. So they have different advantages in life.",
    "mating_1_1_4": "As you can see here, Fonz has all his traits under him. They are 'thick mouth and tongue', 'thick fur and underwool', and 'longer legs and wide/thick feet'.",
    "mating_1_1_5": "While Sahara chose 'long eyelashes and thick eyebrows', 'camel humps', and 'camel's enhanced metabolism'.",
    "mating_1_1_6": "Fonz and Sahara then mated and conceived a child. Her name is 'Sophia'. By conceiving Sophia, they are passing all their traits to her. These traits are called inherited traits.",
    "mating_1_1_7": "Please tap and drag the trait icons one-by-one.",
    "mating_1_1_8": "Drag all the traits and drop them one-by-one into the camel silhouette in the middle  to complete the game. This will give the traits of Fonz and Sahara to Sophia.",
    "mating_1_2_1": "Good. You have given all the traits to Sophia. Now she will inherit all of the traits from both her parents. These traits are called inherited traits.",
    "mating_1_2_2": "An inherited trait is a characteristic or feature that is passed down from parents to their offspring. They are passed down by means of genetic materials.",
    "mating_1_2_3": "Sophia is one of the next generation of camels that are descended from the ancient camels. We call them modern camels.",
    "mating_1_2_4": "Modern camels will have all the necessary traits that are needed to survive the harsh desert. All camels will have these traits from now on.",
    "mating_1_2_5": "The traits will be inherited from their parents to their offsprings. The same as their parents and grandparents that inherit them from their ancestors.",
    "mating_1_2_6": "So, Sophia and other modern camels will also have these inherited traits. In turn, Sophia's children will also inherit Sophia's traits, eventually.",
    "mating_1_2_7": "Sophia, as a modern camel, is now well suited to survive the desert. Now let us see how Sophia live in the wilderness.",
    "mating_1_3_1": "Oh no! Sophia has been shot by the hunters! But don't worry, she's not dead yet. She is just sleeping after being hit by a tranquilizer bullet.",
    "mating_1_3_2": "The hunters begin to carry Sophia to their jeep. They are planning to sell Sophia to the nearby circus. The circus are planning to make Sophia their latest attraction.",
    "mating_1_3_3": "This concludes the second stage. Let us review what we have learned so far.",
    "mating_1_3_4": "An inherited trait is a characteristic or feature that is passed down from parents to their offspring. They are passed down by means of genetic materials.",
    "mating_1_3_5": "The traits will be inherited or passed down from their parents to their offsprings. So the next generation of camels will have the same inherited traits as their parents.",
    "mating_1_3_6": "Now, let's continue to the next stage. Where you will learn about learned traits. We will also see the continuation of Sophia's journey in the circus.",
    "training_1_1_1": "We have finally arrived at the last stage of this game. As you may be aware, Sophia has been taken by the hunters. And they, in turn, sell her to the circus.\r\n\r\nThe circus is planning to make Sophia their latest attraction. However, Sophia is still a wild camel. She needs to be trained first before she can become the star of the show...",
    "training_1_1_2": "But first, the circus needs Sophia to be able to run on command. Help the circus trainer to train Sophia to run when they told her to.",
    "training_1_1_3": "Tap the 'Train' button below consecutively to fill the 'Learn-O-Meter' bar.",
    "training_1_2_1": "Good. Now Sophia got a new trait, 'Run on command'. It is an example of learned trait.\r\n\r\nLearned traits are traits that are acquired from experience and training, either by the organism itself or other outside factors, like humans for example.",
    "training_1_2_2": "Some more examples of learned traits are a monkey trained to ride a bike, an otter using a rock to open up the shell of a clam, and circus animals trained to perform for the crowds.",
    "training_1_2_3": "Sophia is almost ready to perform. What she needs now is to be trained to jump on command. So we need to train her again.\r\n\r\nLike before, please help the trainer to train Sophia again.",
    "training_1_2_4": "Again, tap the 'Train' button below consecutively to fill the 'Learn-O-Meter' bar.",
    "training_1_3_1": "Well done. Sophia has learned the trait 'Jump on command'. The trainer can now command Sophia to perform for the audience by running and jumping around the circus area. Sophia is now ready to be the star of the circus.",
    "training_1_3_2": "And with that, we will conclude the third stage. Let us review what we have learned so far.",
    "training_1_3_3": "Learned traits are traits that are acquired from experience and training, either by the organism itself or other outside factors, like humans for example.",
    "training_1_3_4": "Some examples of learned traits are a monkey trained to ride a bike, an otter using a rock to open up the shell of a clam, and circus animals trained to perform for the crowds.",
    "training_1_3_5": "We have arrived at the end of our game. We hope you enjoy your time playing the game while learning all about inherited trait, environmental trait, and learned trait.\r\n\r\nSee you next time!",
    "trait_eyes_name": "Long eyelashes and thick eyebrows",
    "trait_eyes_desc": "Camels have long eyelashes that can keep sand out of their eyes. Furthermore, their eyebrows are thick and can shield their eyes from the desert sun.",
    "trait_eyes_effect": "Reduces damage-over-time from the environment.",
    "trait_feet_name": "Longer legs and wide/thick feet",
    "trait_feet_desc": "Camels have long legs to help carry heavy loads over long distances and keep their body further away from the hot sand. They also have thick leathery patches on their knees to prevent getting burnt when they kneel on the hot desert sand. Furthermore, camels' feet are wide so they can walk on sand more easily. Their huge feet help them to walk on sand without sinking into it.",
    "trait_feet_effect": "Increases speed. Reduces damage-over-time from the environment.",
    "trait_furs_name": "Thick fur and underwool",
    "trait_furs_desc": "Camels have thick fur and underwool. This protects them from heatstrokes from the desert sun, while also keeping them warm at night or in the winter.",
    "trait_furs_effect": "Reduces damage-over-time from the environment.",
    "trait_humps_name": "Camel humps",
    "trait_humps_desc": "One of the most unique things about camels are their humps. Camels store fat in their humps. The fat can be used as a source of food and energy when they can't find any food in the desert. Camels can survive without food for days just by using the fat in their humps.",
    "trait_humps_effect": "Increases max food.",
    "trait_metabolism_name": "Camel's enhanced metabolism",
    "trait_metabolism_desc": "The camels' metabolism lowers at night so they don't sweat as much. This in turn will preserve the amount of water in their body. They can live without water for several weeks, and they can last several months without food.",
    "trait_metabolism_effect": "Increases max health.",
    "trait_mouth_name": "Thick mouth and tongue",
    "trait_mouth_desc": "Camels have a large, thick, and leathery mouth that can handle the prickly thorns of almost any vegetation in the desert, such as a cactus. With this trait, camels won't hurt themselves when they are eating a cactus or other thorny plants.",
    "trait_mouth_effect": "Nullifies damage from eating a cactus.",
    "trait_run_name": "Run on command",
    "trait_run_desc": "Due to the harsh training of the camel trainer, Sophia will now run on command. This will help the camel to perform better for the show.",
    "trait_run_effect": "Run when the trainer told the camel to",
    "trait_jump_name": "Jump on command",
    "trait_jump_desc": "After many attempts to command Sophia to jump, the trainer has finally succeeded. Now, Sophia can jump when the trainer told her to. This will help Sophia to jump over obstacles in the show.",
    "trait_jump_effect": "Jump when the trainer told the camel to"
  }
}
