{
    "en": {
        "fairyTwelveBags": "So the question is, how much do twelve bags weigh?",
        "fairyStartFormulaShare": "Let's find out, shall we?",
        "fairyFirstSplitted": "For the area of one and a half itself, we can represent it with an area of one square and a half square along the x axis like so.",
        "fairySixHalfLbs": "By doing some conversion, we now know that twelve times one fourth pounds is equal to six times a half pound.",
        "fairyAfterWrongWeightShare": "You know, you need to study your math more. There are plenty of people out there who will trick you like I did.",
        "fairyTwelveBagsRepresent": "First we must represent twelve bags as twelve times a fourth of a circle like so.",
        "fairyWowAlot": "Wow, that's a lot! And now they are all yours.",
        "fairyWantShare": "But to pass this chamber, you must give some of them to me. These clothes and magic powers are expensive, you know?",
        "fairyBackSoSoon": "Back so soon? Did you miss me, perhaps?",
        "fairyAreaAnswer": "Adding two fourths and one fourth together will give us our final answer which is three fourths.",
        "fairyWrongTotalWeight": "So I guess you are wrong then. You need to learn more.",
        "fairyWeightAnswer": "Alright, let's see whether your answer is correct or not.",
        "fairyWrongWantShare": "Right, like before, you need to give me some of them before I'll let you pass. I need a third of what you have right now. So, that should be five pounds, right?",
        "fairySecondSplitted": "While for the area of a half, we can represent it as an area of a half square along the y axis like so.",
        "fairyResultWeight": "Now we know that twelve bags of jewels equal to three pounds. So the correct answer is three pounds.",
        "fairyYouMayGoNow": "The door has been opened. You may go now.",
        "fairyDefeatReply2": "Wow, you're a lucky boy. But that’s the wrong way to do it. I'll teach you the proper way so next time you can win without guessing.",
        "fairyStop": "Stop! Who goes there?",
        "fairyOffYouGo": "Now off you go! See you soon. Or not.",
        "fairyWrongWeight": "Umm. Yes, thank you. That is indeed the total weight of what you have right now.",
        "fairyAnswerBlueWeightWrong": "Too bad, your answer is wrong. But cheer up! At least you've got three pounds of jewels now.",
        "fairyDefeatIntro": "That was unexpected. A mere boy defeated me.",
        "fairyFormulaStart": "Get ready! I'll teach you how to solve the equation from before.",
        "fairyPrepareYourself": "Prepare yourself!",
        "fairyAddHealth": "Before you go, I will give you a reward. I will make you have more health than before, so you can survive longer.",
        "fairyDefeatReply3": "Let us review the equation and see if your calculation is correct.",
        "fairyRightShare": "So, based on that, you are correct. Awesome!",
        "fairyCountResult": "You have acquired twelve bags of fairy jewels. Each bag weighed a fourth of a pound. How many pounds do you have right now?",
        "fairyCorrectWeightCorrectShare": "Wow. Your math skill is amazing! That is indeed correct.",
        "fairyHalfPlusFourth": "Now we can convert the equation from one and a half times a half to a half plus a fourth.",
        "fairyStartFormulaWeight": "We will do it by using a fraction visual model where a full circle will represent one pound.",
        "fairyDivideCircle": "We can represent this by dividing the circles by three and give me one of them. So it equals to one circle of one pound.",
        "fairyWrongWeightShare2": "Actually, you are wrong since the beginning. The total weight of the bags should be twenty over four pounds. And you have given me half of it.",
        "fairyTwoFourthPlusFourth": "Next we have to make sure we have the same denominators to add them up. So now we get two fourths plus one fourth.",
        "fairyOriginalQuestion": "Now, let us go back to the original question of one and a half times a half.",
        "fairyWrongShare": "So, that means you are incorrect. But since I'm an honest fairy, I'll just take my correct portion, which is one pound of fairy jewels.",
        "fairyAdvice": "You know, you should brush up on your math. You wouldn't survive the dungeon otherwise.",
        "fairyEasyMode": "But anyway, I'll activate the easy mode since it's apparently too hard for you.",
        "fairyAnswerShare": "Is that your final answer? Are you sure you have picked the correct answer?",
        "fairySimplifyMixed": "First we need to simplify the mixed number one and a half.",
        "fairyAreaSplittedQuestion": "Which is in fact the same with the intersection of area of one and a half and area of a half",
        "fairyRightTotalWeight": "Way to go! You are correct. You are one smart kid.",
        "fairyWrongWeightShare1": "Actually, you are wrong since the beginning. The total weight of the bags should be twenty over four pounds. So, you are actually giving me all of them.",
        "fairyEndingBlueOpening": "So, you have returned. Well done! Let’s see how much you've got.",
        "fairyYouMayHaveHeard": "You may have heard of me from my sister, Zuma. Unlike her, I'm not kind enough to guide you along your way. I just need you to pass my test with your own strength.",
        "fairyNextTask": "Now, for your next task. In the chamber ahead of you, you will find riches and wealth, as well as dangers.",
        "fairyMayIntroduce": "May I Introduce myself? I am Zaimee, the Gatekeeper of The Dungeon of Problems.",
        "fairyMixedHasSimplified": "Now we have a new fraction number, three halves.",
        "fairyLetsStart": "Okay then, let's start. You now have twenty bags of fairy jewels. Like before, each weighed a fourth of a pound. So how many pounds do you have now?",
        "fairyThatWillLeave": "That will leave you with two pounds or eight bags of jewels. Wow, you are rich now. You can sell them for a lot of money.",
        "fairyAreaFullFormula": "So we can now see that area of one and a half times area of a half equals to area of a half plus a fourth.",
        "fairyOpeningFormula": "Consider the equation one and a half times a half like so.",
        "fairyMultiplyDenominator": "We do it first by multiplying the whole number to the denominator.",
        "fairyBagFourthCircle": "We know that one bag weighed a fourth pound. With the fraction visual model we can represent it with a fourth of a circle like this.",
        "fairyDefeatIntro2": "My name is Zuma, the protector of this Dungeon of Problems. I underestimated you, mortal. To think that you could defeat me!",
        "fairyAreaMovingAnimation": "Next, we will have to calculate the intersecting area between the two and the result is area of a half plus a fourth.",
        "fairyAnswerBlueWeightCorrect": "Way to go! You are indeed correct! You've got three pounds of expensive jewels!",
        "fairyBewareThough": "Beware, though! She is not as lenient as I am. You must really know what you're doing to get past her.",
        "fairyMultiplyNumDenom": "We need to multiply numerator with numerator, and denominator with denominator like so.",
        "fairyThreeLbsRepresent": "We know that you have three pounds of jewels in your inventory. We can represent them in circles of one pound each like so.",
        "fairyThreeLbsTimesThird": "Next, I need you to give me one third of them. That means I need you to multiply three pounds of jewels by one third.",
        "fairyCircleIsFourth": "As we know, one circle of one pound is the same with four times one fourth pound.",
        "fairyWantShare2": "It's not much. I just need a third of what you have right now. So can you give it to me, please?",
        "fairyGrabAsMany": "Try to grab as many bags of jewels as you can in there, but beware of goblins.",
        "fairyThreeLbsDividedThree": "It is also equals to three pounds divided by three.",
        "fairyEndStage": "Now you are ready. Just enter the door behind me and you will be set. Good luck.",
        "fairyCorrectWeight": "Amazing! That's the correct answer. I can see now how you managed to go this far.",
        "fairyWrongThankYou": "Nevertheless, thank you! Thank you for being wrong.",
        "fairyAreaFullQuestion": "With those areas in mind, now we have an area representation of the question like so.",
        "fairyOpeningWin": "Done already? That should teach you not to enter this dungeon without my permission.",
        "fairyNewFormula": "Now that we have simplified the mixed fraction, the equation is changed to three halves times a half",
        "fairyDefeatReply1": "I see. Now I understand why you can defeat me. But are you sure? Let us review the equation and see if your calculation is correct.",
        "fairyNextChamber": "Now the door is open. In the next chamber, you will have another chance to get more of these precious jewels.",
        "fairyCorrectWeightWrongShare": "Thank you. You're so kind to give me more than my share. You've given me a half instead of a third of the total jewels.",
        "fairyOpeningDefeat": "Ouch. That hurts! I surrender!",
        "fairyOpeningEndingRed": "Greetings. So, you're the one that Zuma mentioned. I thought you were bigger.",
        "fairyAddNumerator": "Now, we must add the result to the numerator.",
        "fairyWinIntro": "My name is Zuma, the great protector and caretaker of this Dungeon of Problems.",
        "fairyCorrectThankYou": "You should be glad that your math has helped you to finish this dungeon. Thank you for sharing your wealth with me.",
        "fairyButThereObstacle": "But, there is one last quest that you must do. You must appease my sister, Zaimee, in the last chamber after the next one.",
        "fairyAreaModelStart": "But wait, there is another way to calculate mixed fraction multiplications by using Area Fraction Visual Model",
        "fairyBlueShareAnswer": "Since one bag of jewels equals to one fourth pound, we can replace those one fourth circles with bags. So, the answer is one pound or four bags of jewels.",
        "fairySolveFormula": "Congratulations! You've solved the equation. The correct answer is three fourths.",
        "fairyAnywayGoodluck": "Anyway, I'll add some more health for you. Thank you and goodluck.",
        "fairyCorrectWantShare": "Now, just like Zuma, I need a third of what you have right now. That means you should give me two and a half pounds of those fairy jewels.",
        "fairyThreeLbs": "After we do another calculation, we now get three pounds.",
        "fairyWinIntro2": "I think you need more mathematical knowledge. Let me educate you.",
        "noneMoveTo": "Tap anywhere on the map to move.",
        "noneGetBag": "Collect all the bags to proceed to the next stage. But watch out for goblins."
    },
    "_meta": {
        "maxChars": {
            "fairyTwelveBags": 55,
            "fairyStartFormulaShare": 30,
            "fairyFirstSplitted": 135,
            "fairySixHalfLbs": 110,
            "fairyAfterWrongWeightShare": 120,
            "fairyTwelveBagsRepresent": 90,
            "fairyWowAlot": 50,
            "fairyWantShare": 120,
            "fairyBackSoSoon": 45,
            "fairyAreaAnswer": 100,
            "fairyWrongTotalWeight": 60,
            "fairyWeightAnswer": 60,
            "fairyWrongWantShare": 165,
            "fairySecondSplitted": 105,
            "fairyResultWeight": 105,
            "fairyYouMayGoNow": 50,
            "fairyDefeatReply2": 140,
            "fairyStop": 25,
            "fairyOffYouGo": 45,
            "fairyWrongWeight": 90,
            "fairyAnswerBlueWeightWrong": 100,
            "fairyDefeatIntro": 60,
            "fairyFormulaStart": 70,
            "fairyPrepareYourself": 20,
            "fairyAddHealth": 115,
            "fairyDefeatReply3": 70,
            "fairyRightShare": 50,
            "fairyCountResult": 125,
            "fairyCorrectWeightCorrectShare": 60,
            "fairyHalfPlusFourth": 95,
            "fairyStartFormulaWeight": 100,
            "fairyDivideCircle": 125,
            "fairyWrongWeightShare2": 150,
            "fairyTwoFourthPlusFourth": 115,
            "fairyOriginalQuestion": 80,
            "fairyWrongShare": 140,
            "fairyAdvice": 90,
            "fairyEasyMode": 85,
            "fairyAnswerShare": 80,
            "fairySimplifyMixed": 65,
            "fairyAreaSplittedQuestion": 100,
            "fairyRightTotalWeight": 60,
            "fairyWrongWeightShare1": 160,
            "fairyEndingBlueOpening": 70,
            "fairyYouMayHaveHeard": 170,
            "fairyNextTask": 110,
            "fairyMayIntroduce": 85,
            "fairyMixedHasSimplified": 50,
            "fairyLetsStart": 150,
            "fairyThatWillLeave": 125,
            "fairyAreaFullFormula": 110,
            "fairyOpeningFormula": 65,
            "fairyMultiplyDenominator": 70,
            "fairyBagFourthCircle": 135,
            "fairyDefeatIntro2": 130,
            "fairyAreaMovingAnimation": 125,
            "fairyAnswerBlueWeightCorrect": 85,
            "fairyBewareThough": 105,
            "fairyMultiplyNumDenom": 95,
            "fairyThreeLbsRepresent": 130,
            "fairyThreeLbsTimesThird": 120,
            "fairyCircleIsFourth": 90,
            "fairyWantShare2": 100,
            "fairyGrabAsMany": 85,
            "fairyThreeLbsDividedThree": 60,
            "fairyEndStage": 85,
            "fairyCorrectWeight": 90,
            "fairyWrongThankYou": 60,
            "fairyAreaFullQuestion": 90,
            "fairyOpeningWin": 90,
            "fairyNewFormula": 100,
            "fairyDefeatReply1": 140,
            "fairyNextChamber": 115,
            "fairyCorrectWeightWrongShare": 120,
            "fairyOpeningDefeat": 40,
            "fairyOpeningEndingRed": 85,
            "fairyAddNumerator": 50,
            "fairyWinIntro": 85,
            "fairyCorrectThankYou": 120,
            "fairyButThereObstacle": 130,
            "fairyAreaModelStart": 115,
            "fairyBlueShareAnswer": 160,
            "fairySolveFormula": 90,
            "fairyAnywayGoodluck": 70,
            "fairyCorrectWantShare": 140,
            "fairyThreeLbs": 60,
            "fairyWinIntro2": 70,
            "noneMoveTo": 45,
            "noneGetBag": 120
        }
    }
}