{
  "_meta": {
    "maxChars": {
      "start_button": 20,
      "plants": 20,
      "herbivores": 20,
      "carnivores": 20,
      "wildcards": 20,
      "miracles": 20,
      "omni_decomposers": 30,
      "double": 10,
      "reset_button" : 20,
      "create_button" : 20,
      "use_button" : 20,
      "cancel_button" : 20,
      "yes_button" : 10,
      "no_button" : 10,
      "stg1_ideal_percent": 30,
      "stg1_current_percent": 30,
      "stg1_wakeup1": 30,
      "stg1_wakeup2": 30,
      "stg1_greetings1": 100,
      "stg1_greetings2": 250,
      "stg1_ecosystem1": 280,
      "stg1_organism1": 200,
      "stg1_organism2": 260,
      "stg1_organism3": 300,
      "stg1_gameplay1": 230,
      "stg1_gameplay2": 230,
      "stg1_gameplay3": 350,
      "stg1_gameplay4": 300,
      "stg1_gameplay5": 230,
      "stg1_start1": 230,
      "stg1_start2": 80,
      "stg1_wildcard": 80,
      "stg1_welldone": 150,
      "stg2_greetings1": 200,
      "stg2_greetings2": 350,
      "stg2_greetings3": 300,
      "stg2_organisms": 100,
      "stg2_plants": 350,
      "stg2_herbivores": 350,
      "stg2_carnivores": 350,
      "stg2_omni_decomposers": 350,
      "stg2_foodweb1" : 380,
      "stg2_foodweb2" : 250,
      "stg2_no_omnidec" : 380,
      "stg2_gameplay1" : 380,
      "stg2_gameplay2" : 320,
      "stg2_startgame" : 100,
      "stg2_camel1" : 320,
      "stg2_camel2" : 400,
      "stg2_tiger1" : 280,
      "stg2_tiger2" : 350,
      "stg2_miracles" : 80,
      "stg2_miracles_result0" : 150,
      "stg2_miracles_result1" : 150,
      "stg2_miracles_result2" : 150,
      "stg2_miracles_result3" : 150,
      "stg2_miracles_result4" : 150,
      "stg2_miracles_result5" : 150,
      "sim_result_balance" : 100,
      "sim_result_plant_less" : 100,
      "sim_result_plant_more" : 150,
      "sim_result_herb_less" : 100,
      "sim_result_herb_more" : 150,
      "sim_result_carn_less" : 150,
      "sim_result_carn_more" : 150,
      "sim_result_gone_all" : 120,
      "sim_result_gone_plant" : 160,
      "sim_result_gone_plantherb" : 100,
      "sim_result_gone_herb" : 150,
      "sim_result_gone_herbcarn" : 100,
      "stg2_welldone" : 150,
      "stg2_badend" : 220,
      "stg2_endstage" : 220,
      "stg3_greetings1": 350,
      "stg3_greetings2": 300,
      "stg3_greetings3": 280,
      "stg3_greetings4": 350,
      "stg3_greetings5": 350,
      "stg3_greetings6": 200,
      "stg3_welldone": 380,
      "stg3_endstage1": 250,
      "stg3_endstage2": 350
    }
  },
  "en": {
    "start_button": "Start!",
    "plants": "Plants",
    "herbivores": "Herbivores",
    "carnivores": "Carnivores",
    "wildcards": "Wild Cards",
    "miracles": "Miracles",
    "omni_decomposers": "Omnivores and Decomposers",
    "double": "Double",
    "reset_button" : "RESET",
    "create_button" : "CREATE",
    "use_button" : "USE",
    "cancel_button" : "CANCEL",
    "yes_button" : "YES",
    "no_button" : "NO",
    "stg1_ideal_percent": "Ideal Percentages",
    "stg1_current_percent": "Current Percentages",
    "stg1_wakeup1": "Wake up... WAKE UP!",
    "stg1_wakeup2": "Wake up, O' mighty one!",
    "stg1_greetings1": "Good. You are awake now. You should be working as soon as possible.  We have much to do.",
    "stg1_greetings2": "What do you mean you don't know what you are supposed to do? You are the God of The Grassland. And I, your humble advisor and right hand man. Right now, you have to design, create and manage a balanced and harmonious grassland ecosystem.",
    "stg1_ecosystem1": "You do know what an ecosystem is, right? An ecosystem is a community made up of living organisms and nonliving components such as air, water, and mineral soil.  An ecosystem includes all of the living organisms and nonliving components in a shared environment.",
    "stg1_organism1": "I have helped you to design and create the non living components of the ecosystem, for instance the land, soil, air, water, sunlight, etc, when you are still asleep. Now you can do the rest.",
    "stg1_organism2": "What you must do is to create and design the composition and amount of the living organisms that will live on the grassland. In short, what you have to do right now is to create a number of plants, herbivores and carnivores that will live in the grassland. ",
    "stg1_organism3": "You have to create a community that includes a number of each organisms' population so that the ecosystem will be healthy and balanced. A population is organisms of the same species that live in the same place together. And a community is all of the populations that live together in the same space.",
    "stg1_gameplay1": "In order to do your job and create a good amount of organism on the grassland, all you have to do is to match at least 3 of the same type of these items: plants, herbivores, carnivores, wild cards, and miracles.",
    "stg1_gameplay2": "Here is the breakdown of the items:\r\n\r\nThese items represent the organisms that will live on the grassland. These organisms are plants, herbivores and carnivores. We will discuss about them more on the next stage.",
    "stg1_gameplay3": "Each type will have different values to create organisms on the grassland. A plant item will create 2500 plants, a herbivore item will create 250 herbivores and a carnivore item will create 25 carnivores. You must make sure that the percentages of the organism types are as close as possible to the ideal percentage like in the picture:",
    "stg1_gameplay4": "The wild card item represents a special item that you can use to determine how many and what type of organism that you will create yourself. If you have matched some of the wild card items, you can create any type of organism with the amount of the number of matched wild cards.",
    "stg1_gameplay5": "The miracle item represents a special item that you can use to miraculously create some organisms in the next stage. You have to collect 3 miracle parts to gain 1 miracle. It will surely help you in the next stage.",
    "stg1_start1": "You should know how to do your job by now. To sum it up, all you need to do is just to match at least 3 items vertically or horizontally like the picture on the left.\r\n\r\nYou can also tap the 'RESET' button to reset the board.",
    "stg1_start2": "Okay, without further ado, let's get it on...",
    "stg1_wildcard": "Please choose the organism that you want to create:",
    "stg1_welldone": "Well done, Master. The grassland is now full of life. Now, let us see how life flourish in the grassland. Let's go to the next stage.",
    "stg2_greetings1": "Welcome back, Master! I guess now is the time to unleash life on the grassland. You've done well so far. But is it good enough that it will be balanced? Let us find out!",
    "stg2_greetings2": "All of your achievements in the last stage will carry on to this stage. We will create plants, herbivores, and carnivores based on what you have collected so far. For the plants, we choose bushes. While for herbivores, we choose rabbits. And for the carnivores, foxes. These three species are enough for now.",
    "stg2_greetings3": "The miracles that you have collected will also carry on to this stage. You will probably need them to make the ecosystem stable so that it can last for a long time. You can use the miracles to create life at will. Just tap on the 'USE' button on the bottom right corner.",
    "stg2_organisms": "Also I haven't really explained about the types of organisms, right? So here it is...",
    "stg2_plants": "Plants are organisms that act as the producers. Producers are organisms that can produce their own food to obtain energy. They can turn sunlight and oxygen into energy and store it in their body. In turn, the consumers that consume them (ie. herbivores) will get the energy to live from the producers' stored energy.",
    "stg2_herbivores": "Herbivores are animals that consume only plants. They are one of the consumer organisms. Consumers are animals that eat other organisms to obtain energy. They can't produce energy by themselves like producers. So they take the energy from the producers (in this case plants) to live.",
    "stg2_carnivores": "Carnivores are animals that consumes only other animals. They are also one of the consumer organisms. Carnivores act as predators of other animals. Predators are animals that hunt other animals for food. What they hunt are called their preys. Preys are animals that can be hunted by another animals for food.",
    "stg2_omni_decomposers": "There are two other types of organisms, omnivores and decomposers. Omnivores are animals that consume both plants and animals. Some examples of omnivores are ducks, pigs, humans, etc. Decomposers are organisms that break down dead plant and animal remains.  Some of their examples are fungi, worms, bacteria, etc.",
    "stg2_foodweb1" : "Producers create their own food and energy from the water and sunlight. The consumers will then take this energy by eating the producers or other consumers. And when they all die, the decomposers will break down their body so that the nutrients and energy can be returned to the land. This cycle of energy, to eat and to be eaten, is called a 'Food Web'.",
    "stg2_foodweb2" : "Food Web looks like this. Plants will be eaten by herbivores (and omnivores), herbivores will be eaten by carnivores (and omnivores). All of them will be decompossed by the decomposers when they die.",
    "stg2_no_omnidec" : "Now you have learned all about the organisms in your domain, the grassland. While the decomposers are important, you don't have to worry about them. I've made lots of them beforehands so there should be plenty of them now. And we don't have any omnivores on the grassland. So what you should be aware of are the plants, herbivores, and carnivores.",
    "stg2_gameplay1" : "In this stage, you can see how each organisms will increase their population by giving birth, and also decrease it by death and consumption by their predators.  You must manage and control the population of the plants, herbivores, and carnivores so that they can last for ages. We should try to see whether they can stay balanced and survive for 50 years.",
    "stg2_gameplay2" : "You can also use your miracles to help you with the job at hand. Just click the 'USE' button on the bottom left corner. You can use 1 miracle to create either 100000 plants, 10000 herbivores, or 1000 carnivores. Or, you can use 3 of them at once to double the value of either of those 3 types.",
    "stg2_startgame" : "I hope you understand what you need to do now. Alright then, let's get this started...",
    "stg2_camel1" : "Oh no! A pack of camels are coming from the the desert. They migrated to the grassland because the climate change has made the desert to be even barren and the vegetation there died so there's no more food for the. So now they are fighting for food with the bunnies, the herbivore of the grassland.",
    "stg2_camel2" : "The camels in this case are invasive organisms. They invade other organisms' ecosystem and will compete with resources with the organisms' that are already there in the first place. If nothing is done, they can threaten the balance of the ecosystem and will make the species of the organisms residing in the grassland to become extinct. Extinction occurs when all of the members of a species die.",
    "stg2_tiger1" : "There are some tigers coming to the grassland from the nearby forest. They migrated to the grassland because the humans destroyed their home, the forest, to make way for the development of houses. Now, the foxes have some competitions to hunt foods.",
    "stg2_tiger2" : "This pack of tigers are also invasive organisms. But they invaded the grassland because they have no other option. Most of the invasive organisms happen because of the changes of environment that are caused by human activities, either deliberately or not. And if they are not taken care of, the environment will get the consequences.",
    "stg2_miracles" : "Please choose the miracle that you want to perform:",
    "stg2_miracles_result0" : "You have successfully performed the miracle. The plants are increasing by 100000 bushes.\r\n\r\nDo you want to perform another miracle?",
    "stg2_miracles_result1" : "You have successfully performed the miracle. The bush population is twice as much than before.\r\n\r\nDo you want to perform another miracle?",
    "stg2_miracles_result2" : "You have successfully performed the miracle. The herbivores are increasing by 10000 bunnies.\r\n\r\nDo you want to perform another miracle?",
    "stg2_miracles_result3" : "You have successfully performed the miracle. The bunny population is twice as much than before.\r\n\r\nDo you want to perform another miracle?",
    "stg2_miracles_result4" : "You have successfully performed the miracle. The carnivores are increasing by 1000 foxes.\r\n\r\nDo you want to perform another miracle?",
    "stg2_miracles_result5" : "You have successfully performed the miracle. The fox population is twice as much than before.\r\n\r\nDo you want to perform another miracle?",
    "sim_result_balance" : "The ecosystem is in a balanced state. Every thing is as it should be. Well done!",
    "sim_result_plant_less" : "Beware! There are less plants to support the herbivores' life now.",
    "sim_result_plant_more" : "There are more plants than herbivores' consumption rate. It's okay, but they will occupy most of the grassland if nothing is done.",
    "sim_result_herb_less" : "Beware! There are less herbivores to support the carnivores' life now.",
    "sim_result_herb_more" : "There are more herbivores than carnivores' consumption rate. Be careful that it won't make the ecosystem unstable by overeating of the plants.",
    "sim_result_carn_less" : "Beware! There are less carnivores now. Let's hope that the herbivores' population won't be out of control.",
    "sim_result_carn_more" : "There are more carnivores than their prey, the herbivores, now. Sooner or later the herbivores will go extinct.",
    "sim_result_gone_all" : "All are gone now! There is no plant, herbivore or carnivore left on the land. You have failed.",
    "sim_result_gone_plant" : "Plants are gone now. Not a single one survives. Afterwards, herbivores will also be gone because of starvation. And then the carnivores next.",
    "sim_result_gone_plantherb" : "Plants and herbivores are gone. In due time, so will carnivores.",
    "sim_result_gone_herb" : "All herbivores are gone now due to over consumption by the carnivores. In time, the carnivores too will die of starvation.",
    "sim_result_gone_herbcarn" : "All herbivores and carnivores are gone now. Only the plants remain unchallenged.",
    "stg2_welldone" : "Well done, Master. The grassland has been full of life and balanced for 50 years now. You've done a good job!",
    "stg2_badend" : "Aw, what a shame. The grassland is wrecked. The ecosystem is gone now. And all or some of the species are extinct. The ecosystem was unbalanced, and because of that life on the grassland is no more.",
    "stg2_endstage" : "Now let us go to the next stage just to see how things will go in an ideal condition. Where the ratio of the organisms are ideal, and there is no invasive species whatsoever.",
    "stg3_greetings1": "Welcome again, Master! Creating and managing the ecosystem is difficult, isn't it? The ecosystem is such a delicate system that is very hard to balance and harmonize. Every element should be at the right amount and ratio so that the balance between birth rate, death rate and consumption rate.",
    "stg3_greetings2": "Now, I will give you a surprise. You see, I have also been working for your predecessor, the previous God of the Grasslands. Before his departure, he told me to give something to the next God of the Grasslands. Here it is:",
    "stg3_greetings3": "Wow. That godly power is always amazing. Anyway, the previous God has made a miniature world with a fixed amount of organisms and other elements of the ecosystem in it. He wanted you to know what would happen in a stable and harmonious ecosystem.",
    "stg3_greetings4": "He wanted you to learn from this experience with the hope that you will be a better God that can create and manage a beautiful, vibrant, balanced, and harmonious grassland ecosystem. You don't have to do anything in this miniature world. Just sit back and watch as life takes its course in the grassland.",
    "stg3_greetings5": "This world will only last for 50 years, like the previous one that we have built. But you don't have any authority in this one. So you can not do anything but watch while it grows. Because of that, you can't really use your miracles here. There also won't be any invasive species like before so you don't have to worry.",
    "stg3_greetings6": "The world will run at a faster speed so you don't get bored. Are you excited to see what an ecosystem in balance and harmony looks like?\r\n\r\nLet's start, shall we?",
    "stg3_welldone": "Now that we have reached the end of the 50 years time in this miniature world, maybe you can see what it's like to have a balance in your ecosystem. The organisms live in harmony and grow together so that a certain population of an organism doesn't increase or decrease in accordance to the others. The can make the ecosystem to be self-sustainable.",
    "stg3_endstage1": "At last, we have reached the end of our little journey. Just remember what you have learned until now. I hope you can create a better grassland in the future. And as a God of the Grasslands, it is your duty to do so.",
    "stg3_endstage2": "Even if you are just a simple human being without the godly powers and miracles, it is still your duty to preserve the balance of the ecosystem. Don't introduce more invasive species into an ecosystem. Think about the effect of what you are doing. Be in harmony with nature.\r\n\r\nIt's time for me to go now. See you later..."
  }
}
